Tekla Open API Reference for Tekla Structures 2025
Distance.ToDecimalString Method (String, IFormatProvider, Distance.UnitType)
 Converts the distance to a decimal string representation.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToDecimalString(
	string format,
	IFormatProvider formatProvider,
	Distance.UnitType unitType
)
Public Function ToDecimalString (
	format As String,
	formatProvider As IFormatProvider,
	unitType As Distance.UnitType
) As String
Parameters
format
Type: System.String
The format string.
formatProvider
Type: System.IFormatProvider
The number format provider.
unitType
Type: Tekla.Structures.Datatype.Distance.UnitType
The unit type.
Return Value
Type: String
The string representation of the distance.
Exceptions
Exception | Condition
ArgumentException | Thrown if an invalid unit type is specified.
Examples
 This example shows how to specify a number format, a format provider and a unit type when converting a Distance instance into a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           Distance.UseUnitsInDecimalString = true;
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           // Even if the UseFractionalFormat is set to true, we can still get the decimal representation.
           string decimalString = distance.ToDecimalString("0.00", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
       }
}
See Also
Reference
Distance Structure
ToDecimalString Overload
Tekla.Structures.Datatype Namespace